/*

  ******************************************************************************
  * @file 			( фаил ):   ADS1115.c
  * @brief 		( описание ):  	
  ******************************************************************************
  * @attention 	( внимание ):	author: Golinskiy Konstantin	e-mail: golinskiy.konstantin@gmail.com
  ******************************************************************************
  
*/

/* Includes ----------------------------------------------------------*/
#include "ADS1115.h"



extern I2C_HandleTypeDef my_I2C;

/*
	******************************************************************************
	* @brief	 ( описание ):  функция запрос на преобразование "измерение" ( для одиночного режима вызываем каждый раз )
	* @param	( параметры ):	для режима постоянного достаточно вызвать один раз
	* @return  ( возвращает ):	

	******************************************************************************
*/
void ADS1115_converting( uint16_t config ){
	
	uint8_t config_registr[3];
	
	config_registr[0] = 0x01;	// Config register — сюда записываем конфигурацию
	config_registr[1] = config >> 8;
	config_registr[2] = config;
	
	HAL_I2C_Master_Transmit( &my_I2C, ADS1115_ADDRESS, config_registr, 3, HAL_MAX_DELAY );
	
}

//---------------------------------------------------------------------------------------------------------------------


/*
	******************************************************************************
	* @brief	 ( описание ):  функция которая включает режим ( дергает ножкой ALERT ) когда данные готовы и их нужно считать ( для прерывания )
	* @param	( параметры ):	включение или отключение передаем истину или лож
	* @return  ( возвращает ):	

	******************************************************************************
*/
void ADS1115_pulse_alert( bool status ){
	
	// Сначала в регистр АЦП Hi-tresh, передается значение 0xFFFF, а в регистр Lo_thresh значение 0x0000, 
	// тем самым активируется функция компаратора об оповещении после окончания преобразования. 
	
	// В режиме одиночного преобразования на выходе компаратора устанавливается низкий логический уровень 
	// по окончании преобразования, если бит COMP_POL установлен в 0.
	
	// данные настройки записываются в память ADS1115 достаточно отправить один раз
	// установив значения по умолчанию данный режим выключаем
	uint8_t Lo_thresh_register[3];
	Lo_thresh_register[0] = 0x02;			// Lo_thresh register — регистр установки для компаратора, минимальное значение (по умолчанию 0b1000000000000000)
	
	if( status ){
		Lo_thresh_register[1] = 0x00;	// 0x80 (по умолчанию)
		Lo_thresh_register[2] = 0x00;	// 0x00 (по умолчанию)
	}
	else{
		Lo_thresh_register[1] = 0x80;	// 0x80 (по умолчанию)
		Lo_thresh_register[2] = 0x00;	// 0x00 (по умолчанию)
	}
	
	
	uint8_t Hi_thresh_register[3];
	Hi_thresh_register[0] = 0x03;			// Hi_thresh register — регистр установки для компаратора, максимальное значение (по умолчанию 0b111111111111111)
	
	if( status ){
		Hi_thresh_register[1] = 0xff;	// 0x7f (по умолчанию)
		Hi_thresh_register[2] = 0xff;	// 0xff (по умолчанию)
	}
	else{
		Hi_thresh_register[1] = 0x7f;	// 0x7f (по умолчанию)
		Hi_thresh_register[2] = 0xff;	// 0xff (по умолчанию)
	}
	
	
	HAL_I2C_Master_Transmit( &my_I2C, ADS1115_ADDRESS, Lo_thresh_register, 3, HAL_MAX_DELAY );
	HAL_I2C_Master_Transmit( &my_I2C, ADS1115_ADDRESS, Hi_thresh_register, 3, HAL_MAX_DELAY );
}
//----------------------------------------------------------------------------------






/************************ (C) COPYRIGHT GKP *****END OF FILE****/
